Giulio-Bucchi/Robotic-ARM-6-DOF-with-STM32-NUCLEO-F446RE/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
// Sistema di controllo con pulsanti
uint8_t selected_servo = 0;  // Servo selezionato
// SERVO 3  = SERVO 2 (codice/array index 2) 
uint8_t servo_angles[6] = {90, 90, 120, 90, 90, 120}; // Angoli dei 6 servo

// Direzione di rotazione per ogni servo (1 = avanti, -1 = indietro)
// Servo 5 parte da 120° e va verso il basso (direzione -1)
int8_t servo_direction[6] = {1, 1, 1, 1, 1, -1};

// Definizione angoli per i 4 pulsanti (SOLO GPIOA per test)
// A0=0°, A1=90°, A4=180°, A5=90° (ignoriamo A2/A3 per ora)
const uint8_t button_angles[6] = {0, 90, 90, 135, 180, 90};

// Debounce separato per ogni pulsante (6 pulsanti angoli + USER button = 7)
uint32_t last_button_time[7] = {0, 0, 0, 0, 0, 0, 0};
#define DEBOUNCE_DELAY 250  // ms

// Variabile per memorizzare l'angolo del servo
uint8_t servo_angle = 90; // Angolo iniziale a 90°
uint8_t servo_channel = 0; // Canale del servo (0-15)

// Buffer per ricezione UART
uint8_t rx_buffer[50];    // Buffer per costruire il comando
uint8_t rx_index = 0;     // Indice nel buffer comando
uint8_t rx_data;          // Singolo carattere ricevuto

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Indirizzo I2C del PCA9685
#define PCA9685_ADDRESS (0x40 << 1)

// Registri PCA9685
#define PCA9685_MODE1 0x00
#define PCA9685_PRESCALE 0xFE
#define LED0_ON_L 0x06

// Funzione per convertire angolo in valore PWM per servo
// Per servo standard: 1ms=0°, 1.5ms=90°, 2ms=180°
uint16_t Servo_AngleToPWM(uint8_t angle, uint8_t channel) {
    // Limita l'angolo tra 0 e 180
    if (angle > 180) angle = 180;
    
    // Tutti i servo usano lo stesso range INVERTITO
    // Range INVERTITO: da 410 (2ms) a 205 (1ms)
    uint16_t pwm = 410 - ((uint32_t)angle * 205 / 180);
    
    return pwm;
}

// Funzione di inizializzazione con controllo errori
HAL_StatusTypeDef PCA9685_Init(void) {
    uint8_t data;
    HAL_StatusTypeDef status;
    
    // Test 1: Verifica comunicazione I2C
    status = HAL_I2C_IsDeviceReady(&hi2c1, PCA9685_ADDRESS, 3, 100);
    if (status != HAL_OK) {
        // NON TROVA IL PCA9685: lampeggia 15 volte VELOCE
        for(int i = 0; i < 15; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(80);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(80);
        }
        return status;
    }
    
    // Reset completo via I2C
    data = 0x06;
    HAL_I2C_Master_Transmit(&hi2c1, 0x00, &data, 1, 100);
    HAL_Delay(10);
    
    // Sleep mode per cambiare prescaler
    data = 0x10; // Solo bit SLEEP attivo
    status = HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, PCA9685_MODE1, 1, &data, 1, 100);
    if (status != HAL_OK) {
        // ERRORE scrittura MODE1: lampeggia LED veloce 5 volte
        for(int i = 0; i < 5; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(100);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(100);
        }
        return status;
    }
    HAL_Delay(10);
    
    // Imposta frequenza a 50Hz (per servo)
    // Prescaler = round(25MHz / (4096 * 50Hz)) - 1 = 121
    data = 121; // Prescaler per ~50Hz (standard per servo)
    status = HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, PCA9685_PRESCALE, 1, &data, 1, 100);
    if (status != HAL_OK) return status;
    HAL_Delay(5);
    
    // Risveglia il chip: scrivi 0x00 per uscire da sleep
    data = 0x00;
    status = HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, PCA9685_MODE1, 1, &data, 1, 100);
    if (status != HAL_OK) return status;
    HAL_Delay(1);
    
    data = 0x20; // Bit 5 = AI (Auto-Increment)
    status = HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, PCA9685_MODE1, 1, &data, 1, 100);
    if (status != HAL_OK) return status;
    HAL_Delay(1);
    
    // IMPORTANTE: Spegnere TUTTI i canali PWM prima di usarli
    // Questo previene segnali spazzatura che fanno tremare i servo
    for(int i = 0; i < 16; i++) {
        // Imposta OFF = 4096 (sempre OFF, nessun segnale PWM)
        uint8_t off_data[4] = {0, 0, 0, 0x10}; // 0x1000 = 4096 in little-endian
        HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, LED0_ON_L + 4 * i, 1, off_data, 4, 100);
    }
    HAL_Delay(10);
    
