Giulio-Bucchi/Robotic-ARM-6-DOF-with-STM32-NUCLEO-F446RE/Core/Src/main.c
    // Leggi MODE1 per debug
    uint8_t mode1_read;
    status = HAL_I2C_Mem_Read(&hi2c1, PCA9685_ADDRESS, PCA9685_MODE1, 1, &mode1_read, 1, 100);
    
    // Debug: lampeggia in base al valore di MODE1
    if (mode1_read == 0x20 || mode1_read == 0x21) {
        // SUCCESS - 2 lampeggi LENTI
        for(int i = 0; i < 2; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(300);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(300);
        }
    } else if (mode1_read & 0x10) {
        // Ancora in SLEEP - 10 lampeggi
        for(int i = 0; i < 10; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(100);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(100);
        }
    } else {
        // Valore MODE1 inaspettato: lampeggia 7 volte
        for(int i = 0; i < 7; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(150);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(150);
        }
    }
    
    return HAL_OK;
}

// Funzione per impostare PWM con controllo errori
HAL_StatusTypeDef PCA9685_SetPWM(uint8_t channel, uint16_t on, uint16_t off) {
    uint8_t data[4];
    data[0] = on & 0xFF;
    data[1] = on >> 8;
    data[2] = off & 0xFF;
    data[3] = off >> 8;
    
    return HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, LED0_ON_L + 4 * channel, 1, data, 4, 100);
}

// Funzione per spegnere completamente il PWM di un canale
void PCA9685_DisablePWM(uint8_t channel) {
    // Imposta OFF = 4096 (bit 12) per spegnere completamente l'uscita
    uint8_t data[4] = {0, 0, 0, 0x10}; // 0x1000 = 4096 
    HAL_I2C_Mem_Write(&hi2c1, PCA9685_ADDRESS, LED0_ON_L + 4 * channel, 1, data, 4, 100);
}

// Funzione per muovere il servo a un angolo specifico
void Servo_SetAngle(uint8_t channel, uint8_t angle) {
    uint16_t pwm = Servo_AngleToPWM(angle, channel);
    PCA9685_SetPWM(channel, 0, pwm);
}

// Funzione per indicare il servo selezionato con lampeggi LED
void IndicateSelectedServo(uint8_t servo_num) {
    // Lampeggia LED N volte (N = servo_num + 1)
    for(int i = 0; i <= servo_num; i++) {
        HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
        HAL_Delay(150);
        HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
        HAL_Delay(150);
    }
    HAL_Delay(500);
}

// Funzione per verificare se un pulsante è premuto (con debounce)
// button_id: 0-5 per i pulsanti angoli, 6 per USER button
uint8_t IsButtonPressed(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint8_t button_id) {
    if (HAL_GetTick() - last_button_time[button_id] < DEBOUNCE_DELAY) {
        return 0; // Ignora se troppo presto
    }
    
    if (HAL_GPIO_ReadPin(GPIOx, GPIO_Pin) == GPIO_PIN_RESET) {
        last_button_time[button_id] = HAL_GetTick();
        return 1;
    }
    return 0;
}

// Funzione per inviare messaggio via UART
void UART_SendString(char* str) {
    HAL_UART_Transmit(&huart2, (uint8_t*)str, strlen(str), 100);
}

// Funzione per processare comandi ricevuti via UART
void ProcessCommand(char* cmd) {
    char response[100];
    
    // Comando: imposta angolo del servo (0-180)
    if (strncmp(cmd, "angle ", 6) == 0) {
        int angle = atoi(cmd + 6);
        if (angle >= 0 && angle <= 180) {
            servo_angle = angle;
            Servo_SetAngle(servo_channel, servo_angle);
            sprintf(response, "OK: Servo a %d gradi\r\n", servo_angle);
            UART_SendString(response);
        } else {
            UART_SendString("ERROR: Angolo deve essere 0-180\r\n");
        }
    }
    // Comando: - seleziona canale servo (0-15)
    else if (strncmp(cmd, "channel ", 8) == 0) {
        int ch = atoi(cmd + 8);
        if (ch >= 0 && ch <= 15) {
            servo_channel = ch;
            sprintf(response, "OK: Canale %d selezionato\r\n", servo_channel);
            UART_SendString(response);
        } else {
            UART_SendString("ERROR: Canale deve essere 0-15\r\n");
        }
    }
    // Comando:  - mostra stato corrente
    else if (strcmp(cmd, "status") == 0) {
        sprintf(response, "Canale: %d, Angolo: %d°\r\n", servo_channel, servo_angle);
        UART_SendString(response);
    }
    // Comando: - mostra comandi disponibili
    else if (strcmp(cmd, "help") == 0) {
        UART_SendString("\r\n=== COMANDI DISPONIBILI ===\r\n");
        UART_SendString("angle XXX    - Imposta angolo (0-180)\r\n");
        UART_SendString("channel X    - Seleziona canale (0-15)\r\n");
        UART_SendString("status       - Mostra stato corrente\r\n");
        UART_SendString("help         - Mostra questo menu\r\n");
        UART_SendString("===========================\r\n\r\n");
    }
    else {
        UART_SendString("ERROR: Comando non riconosciuto. Scrivi 'help'\r\n");
    }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */

  // LED verde lampeggia 3 volte VELOCE - programma avviato
  for(int i = 0; i < 3; i++) {
      HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
      HAL_Delay(100);
      HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
      HAL_Delay(100);
  }
  HAL_Delay(500);

  // Inizializza PCA9685
  HAL_StatusTypeDef init_status = PCA9685_Init();
  
