Giulio-Bucchi/Robotic-ARM-6-DOF-with-STM32-NUCLEO-F446RE/Core/Src/main.c
  if (init_status != HAL_OK) {
      // Errore inizializzazione - LED fisso
      HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
      while(1);
  }
  
  // Posiziona i servo nelle posizioni iniziali sicure
  for(int i = 0; i < 6; i++) {
      if (i == 2) { 
          servo_angles[i] = 110; // Solo per tenere traccia, ma non invia PWM
      } else if (i == 3) {  // SERVO 3 Inizializza a 120°
          Servo_SetAngle(i, 120);
          servo_angles[i] = 120;
      } else if (i == 5) {  // SERVO 5 - Inizializza a 120°
          Servo_SetAngle(i, 120);
          servo_angles[i] = 120;
      } else {
          Servo_SetAngle(i, 90);  // Altri servo a 90°
          servo_angles[i] = 90;
      }
  }
  HAL_Delay(500);
  
  // Messaggio di benvenuto via UART
  UART_SendString("\r\n\r\n");
  UART_SendString("================================\r\n");
  UART_SendString("  CONTROLLO 6 SERVO CON PULSANTI\r\n");
  UART_SendString("  STM32 + PCA9685\r\n");
  UART_SendString("================================\r\n");
  UART_SendString("USER: Cambia servo\r\n");
  UART_SendString("A0-A5: Angoli (30-180)\r\n\r\n");
  
  IndicateSelectedServo(selected_servo);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    
    // ============= PULSANTE USER: Cambio Servo =============
    if (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_RESET) {
        // Aspetta rilascio pulsante
        while(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_RESET) {
            HAL_Delay(10);
        }
        // Cambia servo selezionato (0-5)
        selected_servo = (selected_servo + 1) % 6;
        // Indica servo selezionato con lampeggi
        IndicateSelectedServo(selected_servo);
        HAL_Delay(300); // Debounce
    }
    
    // ============= TEST DIAGNOSTICO - STAMPA STATO PIN =============
    static uint32_t last_debug_time = 0;
    
    // Ogni secondo, stampa lo stato di tutti i pin (per debug con LED)
    if (HAL_GetTick() - last_debug_time > 2000) {
        last_debug_time = HAL_GetTick();
        // Lampeggio veloce = sistema vivo
        for(int i=0; i<2; i++) {
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
            HAL_Delay(50);
            HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
            HAL_Delay(50);
        }
    }
    
    // ============= PULSANTI: Movimento servo selezionato =============
    // Servo 3 (array index 2) è bloccato: non viene mai mosso
    static uint8_t button_was_pressed = 0; 
    
    if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_10) == GPIO_PIN_RESET) {
        button_was_pressed = 1;  // Pulsante premuto
        
        if (selected_servo == 2) {
            // Servo 3 bloccato: non muovere
        } else if (selected_servo == 3) {
            // Servo 4 (array index 3): limitato tra 120° e 180°
            servo_angles[selected_servo] += (2 * servo_direction[selected_servo]);
            if (servo_angles[selected_servo] >= 180) {
                servo_angles[selected_servo] = 180;
                servo_direction[selected_servo] = -1;
            } else if (servo_angles[selected_servo] <= 120) {
                servo_angles[selected_servo] = 120;
                servo_direction[selected_servo] = 1;
            }
            Servo_SetAngle(selected_servo, servo_angles[selected_servo]);
            HAL_Delay(10);
        } else if (selected_servo == 5) {
            // Servo 6 (array index 5): limitato tra 60° e 120°
            servo_angles[selected_servo] += (2 * servo_direction[selected_servo]);
            if (servo_angles[selected_servo] >= 120) {
                servo_angles[selected_servo] = 120;
                servo_direction[selected_servo] = -1;
            } else if (servo_angles[selected_servo] <= 45) {
                servo_angles[selected_servo] = 45;
                servo_direction[selected_servo] = 1;
            }
            Servo_SetAngle(selected_servo, servo_angles[selected_servo]);
            HAL_Delay(10);
        } else {
            // Oscillazione avanti-indietro per altri servo (range completo 0-180°)
            servo_angles[selected_servo] += (2 * servo_direction[selected_servo]);
            if (servo_angles[selected_servo] >= 180) {
                servo_angles[selected_servo] = 180;
                servo_direction[selected_servo] = -1;
            } else if (servo_angles[selected_servo] <= 0) {
                servo_angles[selected_servo] = 0;
                servo_direction[selected_servo] = 1;
            }
            Servo_SetAngle(selected_servo, servo_angles[selected_servo]);
            HAL_Delay(10);
        }
    } else {
        // Pulsante rilasciato - spegni PWM del servo selezionato
        if (button_was_pressed && selected_servo != 2) {
            PCA9685_DisablePWM(selected_servo);
            button_was_pressed = 0;
        }
    }
    // D3 (PB3): Reset posizione servo selezionato
    if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_3) == GPIO_PIN_RESET) {
        if (selected_servo == 2) {
            // Servo 3 bloccato: non muovere
        } else if (selected_servo == 3){
            servo_angles[selected_servo] = 120;
            Servo_SetAngle(selected_servo, 120);
            HAL_Delay(500);  // Aspetta che raggiunga la posizione
            PCA9685_DisablePWM(selected_servo);  // Poi spegni PWM
        } else if (selected_servo == 5){
            servo_angles[selected_servo] = 120;
            Servo_SetAngle(selected_servo, 120);
            HAL_Delay(500);  // Aspetta che raggiunga la posizione
            PCA9685_DisablePWM(selected_servo);  // Poi spegni PWM
        } else{
            servo_angles[selected_servo] = 90;
            Servo_SetAngle(selected_servo, 90);
            HAL_Delay(500);  // Aspetta che raggiunga la posizione
            PCA9685_DisablePWM(selected_servo);  // Poi spegni PWM
        }
        while(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_3) == GPIO_PIN_RESET) {
            HAL_Delay(10);
        }
        HAL_Delay(200);
    }
    // Piccolo delay per non sovraccaricare
    HAL_Delay(10);

